Revit 2027 API
SelectionFilterElement.AddSet Method
 Adds a set of ElementIds to the filter's set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSet(
	ICollection<ElementId> ids
)
Public Sub AddSet (
	ids As ICollection(Of ElementId)
)
public:
void AddSet(
	ICollection<ElementId^>^ ids
)
member AddSet :
        ids : ICollection<ElementId> -> unit
Parameters
ids ICollection<ElementId>
 The set of ElementIds to add.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace